#共同開発問題集
#回答者　sawa

# Q1:回答済
# Q2:回答済
# Q3:回答済
# Q4:回答済
# Q5:回答済
# Q6:回答済
# Q7:回答済
# Q8:回答済
# Q9:回答済
# Q10:回答済
# Q11:回答済
# Q12:回答済
# Q13:回答済
# Q14:回答済
# Q15:回答済
# Q16:回答済
# Q17:回答済
# Q18:回答済
# Q19:回答済
# Q20:回答済
# Q21:レビュー待ち（修正２）
# Q22:回答済
# Q23:レビュー待ち（修正２）
# Q24:回答済
# Q25:回答済
# Q26:回答済
# Q27:回答済
# Q28:レビュー待ち(修正２)
# Q29:回答済
# Q30:回答済
# Q31:回答済
# Q32:レビュー待ち（修正）
# Q33:回答済
# Q34:レビュー待ち（リファクタリング）
# Q35:レビュー待ち（リファクタリング）
# Q36:レビュー待ち（リファクタリング）
# Q37:レビュー待ち（リファクタリング）

require './task'
# q＋番号で処理を実行

q21
q23

require './class_in_q27-'