#共同開発問題集
#回答者　sawa

# Q1:回答済
# Q2:回答済
# Q3:回答済
# Q4:回答済
# Q5:回答済
# Q6:回答済
# Q7:回答済
# Q8:回答済
# Q9:回答済
# Q10:回答済
# Q11:回答済
# Q12:回答済
# Q13:回答済
# Q14:回答済
# Q15:回答済
# Q16:回答済
# Q17:回答済
# Q18:回答済
# Q19:回答済
# Q20:回答済
# Q21:レビュー待ち（修正）
# Q22:回答済
# Q23:レビュー待ち（修正）
# Q24:回答済
# Q25:レビュー待ち(修正)
# Q26:回答済（リファクタリング済み）
# Q27:レビュー待ち(修正)
# Q28:レビュー待ち(修正)
# Q29:レビュー待ち
# Q30:レビュー待ち
# Q31:レビュー待ち
# Q32:レビュー待ち
# Q33:レビュー待ち
# Q34:レビュー待ち
# Q35:レビュー待ち
# Q36:レビュー待ち
# Q37:レビュー待ち
require './task'
# q＋番号で処理を実行

q21
q23
q25

require './class_in_q27-'