#共同開発問題集
#回答者　sawa

# Q1:回答済
# Q2:回答済（リファクタリングしました）
# Q3:回答済
# Q4:回答済（リファクタリングしました）
# Q5:回答済
# Q6:レビュー待ち
# Q7:レビュー待ち
# Q8:レビュー待ち
# Q9:レビュー待ち
# Q10:レビュー待ち
# Q11:レビュー待ち
# Q12:レビュー待ち
# Q13:レビュー待ち
# Q14:レビュー待ち
# Q15:レビュー待ち
# Q16:レビュー待ち
# Q17:レビュー待ち
# Q18:レビュー待ち
# Q19:レビュー待ち
# Q20:レビュー待ち
# Q21:未回答
# Q22:未回答
# Q23:未回答
# Q24:未回答
# Q25:未回答
# Q26:未回答
# Q27:未回答
# Q28:未回答
# Q29:未回答
# Q30:未回答
# Q31:未回答
# Q32:未回答
# Q33:未回答
# Q34:未回答
# Q35:未回答
# Q36:未回答
# Q37:未回答
require './task'
# q＋番号で処理を実行
q6
q7
q8
q9
q10
q11
q12
q13
q14
q15
q16
q17
q18
q19
q20