#共同開発問題集
#回答者　sawa

# Q1:回答済
# Q2:回答済
# Q3:回答済
# Q4:回答済
# Q5:回答済
# Q6:回答済
# Q7:回答済
# Q8:レビュー待ち
# Q9:回答済（リファクタリングしました）
# Q10:回答済
# Q11:回答済
# Q12:回答済
# Q13:回答済
# Q14:回答済
# Q15:回答済
# Q16:回答済
# Q17:回答済
# Q18:回答済
# Q19:回答済
# Q20:回答済
# Q21:レビュー待ち
# Q22:レビュー待ち
# Q23:レビュー待ち
# Q24:レビュー待ち
# Q25:レビュー待ち
# Q26:レビュー待ち
# Q27:レビュー待ち
# Q28:レビュー待ち
# Q29:未回答
# Q30:未回答
# Q31:未回答
# Q32:未回答
# Q33:未回答
# Q34:未回答
# Q35:未回答
# Q36:未回答
# Q37:未回答
require './task'
# q＋番号で処理を実行

q8
q21
q22
q23
q24
q25
q26

require './class_in_q27-'