# Q1. 以下の配列から、期待された結果の配列を作成してください
# [1, 2, 3, 4, 5]
# 期待する配列
# [1, 3, 5, 7, 9]

def q1
  array = [ 1, 2, 3, 4, 5 ]
  p array.map { |n| n * 2 - 1 } 
end


# Q2. 以下の配列から、期待された結果の配列を作成してください
# ["田中", "佐藤", "佐々木", "高橋"]
# 期待する配列
# ["田中", "佐藤", "佐々木", "高橋", "斎藤"]

def q2
  array = ["田中", "佐藤", "佐々木", "高橋"]
  array.push("斎藤")
  p array
end


# Q3. 以下の文字列の配列を数字だけの配列に変換してください
# ["1", "2", "3", "4", "5"]
# 期待する配列
# [1, 2, 3, 4, 5]

def q3
  array = ["1", "2", "3", "4", "5"]
  p array.map(&:to_i)
end


# Q4. 以下の二つの配列を合体させた新しい配列を作成してください
# ["dog", "cat", "fish"]
# ["bird", "bat", "tiger"]

def q4
  array1 = ["dog", "cat", "fish"]
  array2 = ["bird", "bat", "tiger"]
  array1.push(array2)
  array1.flatten!
  p array1
end


# Q5. 以下の配列の中に3がいくつあるか数えるコードを書いてください
# [1, 5, 8, 10, 2, 3, 2, 3, 3, 1, 4, 5, 9]

def q5
  array = [1, 5, 8, 10, 2, 3, 2, 3, 3, 1, 4, 5, 9]
  count = array.count(3)
  p count
end